rickymetz/esp32-hackathon/launcher/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 16MB flash, QIO
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# ESP32-S3R8 has 8MB OCTAL PSRAM. OCT mode is NOT the IDF default --
# without it the PSRAM silently fails to initialise.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Room for LVGL + Lua
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# lua_module_lvgl uses LVGL's Tiny TTF for runtime fonts
CONFIG_LV_USE_TINY_TTF=y
CONFIG_LV_TINY_TTF_FILE_SUPPORT=y

# App files on SD need real names, not 8.3. Without this, "weather_clock.lua"
# is invisible to the launcher.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# Custom partition table: the default 1MB app partition cannot fit
# LVGL + Lua + the LVGL bindings.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Serial push needs an INPUT path. The USB-Serial/JTAG secondary console is
# output-only, so promote it to primary -- the board talks to the host over
# native USB, not UART0.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# A runaway app that the Lua hook cannot interrupt (a tight loop inside a C
# call, or inside a coroutine) must not wedge the board forever. Panic on
# watchdog so it reboots into a working launcher instead of warning every
# 5 seconds until someone power-cycles it.
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Default is 1000000, so runaway recursion tries to allocate ~16 MB of Lua
# stack from PSRAM before raising "stack overflow" -- meaning the out-of-memory
# lands on some unrelated allocation first and the real cause is invisible.
CONFIG_LUA_MAXSTACK=65536
